{
  "backend/main.mo": "Main Motoko backend actor implementing recipe management, ingredient costing, production calculations, raw materials CRUD, admin authentication via Principal, and dashboard statistics with persistent storage using Maps.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of all frontend components, pages, and hooks describing their functionality and relationships.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining colors for UI elements like backgrounds, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and script reference to main.tsx module.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with protected routes (dashboard, recipe master, raw material master, production calculator, cost control), Internet Identity authentication guards, theme provider, and toast notifications.",
  "frontend/src/components/CostAnalysis.tsx": "Recipe cost analysis component with recipe selection, quantity input, cost breakdown table that fixes backend unit conversion issues (g→kg, ml→L) for accurate cost calculations, and profit margin calculator with selling price input.",
  "frontend/src/components/DashboardSummary.tsx": "Dashboard summary cards component displaying four metrics (Total Recipes, Total Ingredients, Most Produced Item, Average Food Cost %) fetched from backend with loading skeletons.",
  "frontend/src/components/IngredientCostForm.tsx": "Manages ingredient cost data with CRUD operations, allowing users to edit, save, and clear ingredient costs stored in localStorage and synced with backend mutations.",
  "frontend/src/components/Layout.tsx": "Provides the main application layout with a sticky header, responsive navigation (desktop and mobile sheet menu), main content area, and footer with branding.",
  "frontend/src/components/Navigation.tsx": "Renders navigation menu with route links (Dashboard, Recipe Master, Raw Material Master, Calculator, Cost Control) and logout functionality, supporting both desktop and mobile layouts.",
  "frontend/src/components/ProductionCalculator.tsx": "Calculates production requirements by selecting category, recipe, and quantity, then displays ingredient breakdown with automatic unit conversion (g to Kg, ml to L).",
  "frontend/src/components/ProductionHistory.tsx": "Displays today's production history in a table format showing time, recipe name, quantity, and cost with loading skeleton support.",
  "frontend/src/components/RawMaterialForm.tsx": "Form component for adding and editing raw materials with validation for name, unit type, and price, including duplicate checking and enhanced error handling for canister errors.",
  "frontend/src/components/RawMaterialTable.tsx": "Displays a table of raw materials with edit and delete functionality, using React Query hooks for data fetching and mutations. Includes loading skeletons, confirmation dialogs for deletion, and toast notifications for user feedback.",
  "frontend/src/components/RecipeList.tsx": "Renders a list of recipes in a table format showing name, category, portion weight, and ingredient count with edit/delete actions. Displays loading skeletons and an empty state when no recipes exist.",
  "frontend/src/components/RecipeMasterForm.tsx": "Form component for creating and editing recipes with fields for name, category, portion weight, and dynamic ingredient list. Maps raw materials to ingredients and handles form submission with validation and toast notifications.",
  "frontend/src/components/StoreIssueSlip.tsx": "Displays a store issue slip for recipe production showing ingredients and quantities, with print and PDF download functionality. Includes automatic unit conversion (g to kg, ml to L) and number formatting utilities.",
  "frontend/src/hooks/useActor.ts": "Custom React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality using DFINITY's AuthClient. Manages authentication state, identity persistence, and provides status flags for the login process.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for recipes, categories, production calculations, and raw materials, with localStorage-based production history tracking and CRUD operations via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color variables for a warm terracotta/sage theme, including light/dark mode support and print styles for store issue slips.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/CostControl.tsx": "Page component that displays the CostAnalysis component for recipe cost calculation and profit margin analysis.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page showing production summary statistics and production history with date display and summary cards.",
  "frontend/src/pages/Login.tsx": "Login page with Internet Identity authentication that sets up admin access and redirects to home on successful login.",
  "frontend/src/pages/ProductionCalculator.tsx": "Page for calculating raw material requirements for production runs, displaying results and generating store issue slips.",
  "frontend/src/pages/RawMaterialMaster.tsx": "Page for managing raw materials inventory with add/edit forms, data table, and error handling for service issues.",
  "frontend/src/pages/RecipeMaster.tsx": "Page for creating and managing recipes with a list view and form for adding/editing recipes with ingredient details.",
  "frontend/src/utils/dashboardCalculations.ts": "Utility functions for calculating total ingredient consumption, finding top ingredients, and computing total costs from production records.",
  "frontend/src/utils/pdfGenerator.ts": "Generates printable HTML-based store issue slips with recipe details, ingredient lists, and signature sections for production documentation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes using OKLCH color space, typography settings with Inter and Poppins fonts, container queries, animations for accordions, and various UI component styling tokens.",
  "project_state.json": "Project state file tracking a fix request (AR-1) to resolve backend authentication issues where raw material CRUD operations incorrectly throw 'Admin not set up yet' errors despite authenticated admin principals."
}