{
  "backend/main.mo": "Main backend actor implementing recipe management, ingredient costing, production tracking, raw materials CRUD, and dashboard statistics with admin authentication and migration support.",
  "backend/migration.mo": "Migration module that adds isInitialized field to actor state, defaulting to false for backward compatibility.",
  "feature_evidence.json": "Feature evidence report documenting frontend error handling improvements for canister stopped errors across multiple components with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including routing, authentication, recipe management, cost analysis, production calculator, and raw material master features.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes using OKLCH color space.",
  "frontend/index.html": "HTML entry point for the Jeevanam Smart Kitchen Calculator application with root div and module script reference.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with protected routes, authentication guards, theme provider, and toast notifications.",
  "frontend/src/components/CostAnalysis.tsx": "Cost analysis component with recipe selection, ingredient breakdown table that applies proper unit conversion (g→kg, ml→L) for accurate cost calculations, and profit margin calculator.",
  "frontend/src/components/DashboardSummary.tsx": "Dashboard summary displaying four metric cards (total recipes, ingredients, most produced item, average food cost percentage) with loading skeletons.",
  "frontend/src/components/IngredientCostForm.tsx": "Manages ingredient cost data with inline editing, allowing users to set/update costs per unit for all ingredients extracted from recipes, with localStorage persistence and mutation hooks for backend sync.",
  "frontend/src/components/Layout.tsx": "Main application layout component providing header with branding, responsive navigation (desktop/mobile sheet), and footer with attribution link to caffeine.ai.",
  "frontend/src/components/Navigation.tsx": "Navigation component rendering menu items (Dashboard, Recipe Master, Raw Material Master, Calculator, Cost Control) with active state highlighting and logout functionality, supporting both desktop and mobile layouts.",
  "frontend/src/components/ProductionCalculator.tsx": "Production calculator form allowing users to select category/recipe and quantity, then calculates required ingredients with unit conversion (g→kg, ml→L) and displays results in a table.",
  "frontend/src/components/ProductionHistory.tsx": "Displays today's production history in a table showing time, recipe name, quantity, and cost, with loading skeleton and empty state handling.",
  "frontend/src/components/RawMaterialForm.tsx": "Form for adding/editing raw materials with name, unit type, and price fields, including duplicate validation, canister error handling with retry logic, and mutation hooks for backend operations.",
  "frontend/src/components/RawMaterialTable.tsx": "Displays a table of raw materials with edit and delete actions, including loading states, error handling for canister stopped errors, and confirmation dialogs for deletion.",
  "frontend/src/components/RecipeList.tsx": "Renders a list of recipes in a table format showing name, category, portion weight, and ingredient count with edit and delete actions, including empty state handling.",
  "frontend/src/components/RecipeMasterForm.tsx": "Form component for creating and editing recipes with fields for name, category, portion weight, and dynamic ingredient list that maps to raw materials from the backend.",
  "frontend/src/components/StoreIssueSlip.tsx": "Generates and displays a store issue slip for a recipe showing required ingredients with quantities, includes print and PDF download functionality with automatic unit conversion (g to kg, ml to L).",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality, managing auth client creation, identity state, and login status throughout the application.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for recipes, raw materials, production records, and dashboard stats with localStorage-based production history. Includes error handling utilities for canister stopped errors and user-friendly error messages.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for a warm color palette (terracotta, sage green, cream) in light and dark modes, plus print styles for store issue slips.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/CostControl.tsx": "Page component that displays the CostAnalysis component for recipe cost calculation and profit margin analysis.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page showing production summary statistics and production history with date display.",
  "frontend/src/pages/Login.tsx": "Login page handling Internet Identity authentication with automatic admin setup, retry logic for canister stopped errors, and user-friendly error messages.",
  "frontend/src/pages/ProductionCalculator.tsx": "Page component that renders the ProductionCalculator and conditionally displays a StoreIssueSlip based on calculation results.",
  "frontend/src/pages/RawMaterialMaster.tsx": "Page for managing raw materials with add/edit forms, a data table, and global error handling for service unavailability.",
  "frontend/src/pages/RecipeMaster.tsx": "Page for creating and managing recipes with a list view, edit functionality, and a toggle between list and form views.",
  "frontend/src/utils/dashboardCalculations.ts": "Utility functions for calculating total ingredient consumption, finding top ingredients, and computing total production costs from production records.",
  "frontend/src/utils/pdfGenerator.ts": "Generates printable HTML content for store issue slips with ingredient lists, signatures, and formatted production details.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended typography and animation plugins, custom font families (Inter, Poppins), and accordion animations.",
  "project_state.json": "Project state tracking file indicating a fix request for a canister stopped error that prevents raw material operations, with two pending action requests for investigation and backend initialization improvements."
}