{
  "backend/main.mo": "Main Motoko actor defining types (Recipe, Ingredient, RawMaterial, etc.) and functions for recipe management, production calculation, cost analysis, and dashboard stats with admin authentication and initialization checks.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of all frontend components and pages, describing routing, authentication, recipe management, raw material integration, and cost calculation features.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like backgrounds, borders, cards, and charts using oklch color space.",
  "frontend/index.html": "HTML entry point for the application with viewport meta tag, title 'Jeevanam Smart Kitchen Calculator', and script tag loading the React app from main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with protected routes (Dashboard, RecipeMaster, RawMaterialMaster, ProductionCalculator, CostControl) and public login route, wrapped in ThemeProvider with authentication guards.",
  "frontend/src/components/CostAnalysis.tsx": "Cost analysis component that validates ingredient costs from Raw Material Master, applies unit conversion (g→kg, ml→L by dividing by 1000), calculates recipe costs with profit margin, and displays breakdown table with error handling for missing costs.",
  "frontend/src/components/DashboardSummary.tsx": "Dashboard summary component displaying four metric cards (Total Recipes, Total Ingredients, Most Produced Item, Average Food Cost %) using data from useGetDashboardStats hook with loading skeletons.",
  "frontend/src/components/IngredientCostForm.tsx": "Displays a table of ingredient costs derived from raw materials used in recipes, with inline editing capabilities that redirect users to the Raw Material Master page for actual updates.",
  "frontend/src/components/Layout.tsx": "Main layout component providing header with branding, responsive navigation (desktop/mobile), and footer with attribution link to caffeine.ai.",
  "frontend/src/components/Navigation.tsx": "Navigation component rendering menu items (Dashboard, Recipe Master, Raw Material Master, Calculator, Cost Control) with active state highlighting and logout functionality, supporting both desktop and mobile layouts.",
  "frontend/src/components/ProductionCalculator.tsx": "Form component for calculating production requirements by selecting category, recipe, and quantity, displaying ingredient breakdown with automatic unit conversion (g to Kg, ml to L).",
  "frontend/src/components/ProductionHistory.tsx": "Displays today's production history in a table format showing time, recipe name, quantity, and cost for each production entry.",
  "frontend/src/components/RawMaterialForm.tsx": "Form component for adding and editing raw materials with fields for name, unit type, and price per unit, including duplicate name validation and automatic retry logic for canister errors.",
  "frontend/src/components/RawMaterialTable.tsx": "Displays a table of raw materials with edit and delete actions, including loading skeletons, empty state handling, and automatic retry logic with exponential backoff for canister stopped errors during deletion.",
  "frontend/src/components/RecipeList.tsx": "Displays a table of recipes with their categories, portion weights, and ingredient counts, providing edit and delete actions with loading and empty state handling.",
  "frontend/src/components/RecipeMasterForm.tsx": "Form component for creating and editing recipes with fields for name, category, portion weight, and dynamic ingredient list with raw material selection and quantity inputs.",
  "frontend/src/components/StoreIssueSlip.tsx": "Generates and displays a store issue slip for a recipe with specified quantity, showing ingredient requirements with unit conversion (g to Kg, ml to L), and provides print and PDF download functionality.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance based on Internet Identity authentication state, creating authenticated or anonymous actors and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useBackendHealth.ts": "Monitors backend canister health by periodically checking responsiveness every 5 seconds, detecting canister stopped errors, and invalidating all queries when the backend recovers from an unhealthy state.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend operations (recipes, raw materials, production records) with localStorage-based production history, error handling for canister stopped states, and user-friendly error messages.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom warm color palette (terracotta primary, sage green secondary) for light/dark themes, plus print styles for store issue slips and mobile touch target sizing.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/CostControl.tsx": "Cost control page displaying recipe cost analysis with an alert reminding users to add ingredients to raw material master before calculating costs.",
  "frontend/src/pages/Dashboard.tsx": "Production dashboard page showing current date, dashboard summary statistics, and production history components.",
  "frontend/src/pages/Login.tsx": "Login page handling Internet Identity authentication and automatic admin setup with retry logic for canister stopped errors, displaying detailed error information and recovery status.",
  "frontend/src/pages/ProductionCalculator.tsx": "Production calculator page that calculates raw material requirements and displays a store issue slip for the calculated production batch.",
  "frontend/src/pages/RawMaterialMaster.tsx": "Raw material master page for managing inventory with add/edit forms, table display, backend health monitoring, and automatic recovery messaging when service becomes available.",
  "frontend/src/pages/RecipeMaster.tsx": "React page component that manages recipe creation and listing with toggle between list and form views, supporting recipe editing functionality.",
  "frontend/src/utils/dashboardCalculations.ts": "Utility functions for calculating total ingredient consumption, finding top ingredients, and computing total production costs from production records.",
  "frontend/src/utils/pdfGenerator.ts": "Generates HTML-based store issue slip documents for recipes, formatting ingredient quantities and creating downloadable files with signature sections.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended theme settings, typography plugin, and animation utilities for the frontend.",
  "project_state.json": "Project metadata tracking an Internet Identity login issue where canister ohbdn-3yaaa-aaaah-a46oa-cai returns a stopped error (IC0408) during authentication."
}