{
  "backend/main.mo": "Main Motoko backend actor defining types (Recipe, Ingredient, RawMaterial, Unit, CostBreakdown, etc.) and functions for recipe management, production calculation, cost analysis, raw material CRUD operations, and admin authentication with initialization checks.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: comprehensive error handling with retry logic for backend queries, enhanced connection status detection and display, and a global error boundary for authentication/connection errors.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including pages (Dashboard, Login, RecipeMaster, etc.), components (Layout, Navigation, forms, tables), and hooks, detailing their functionality, data flow, and integration with Raw Material Master using rawMaterialId.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for background, foreground, primary, secondary, muted, accent, destructive, borders, charts, and sidebar components using oklch color space.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag, page title 'Jeevanam Smart Kitchen Calculator', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with routes for login, dashboard, recipe master, raw material master, production calculator, and cost control, implementing ProtectedLayout for authentication guards, and wrapping with ThemeProvider and Toaster.",
  "frontend/src/components/ConnectionStatusBanner.tsx": "Fixed-position banner component using useBackendHealth hook to display connection status alerts, showing error messages with retry button when service is unavailable and auto-dismissing success messages when connection is restored.",
  "frontend/src/components/CostAnalysis.tsx": "Cost analysis component that fetches recipes and raw materials, validates ingredient costs, calculates recipe costs with unit conversion (grams to kg, ml to liters) to correct backend calculations, and displays cost breakdown with profit margin calculator.",
  "frontend/src/components/DashboardSummary.tsx": "Displays a dashboard with four stat cards showing total recipes, total ingredients, most produced item, and average food cost percentage. Uses skeleton loaders while fetching data from the useGetDashboardStats hook.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches unhandled errors during app initialization and runtime, displaying user-friendly error messages with recovery instructions and retry functionality. Handles different error types including canister stopped, network, and authentication errors.",
  "frontend/src/components/IngredientCostForm.tsx": "Displays a table of ingredient costs derived from raw materials used in recipes, with inline editing functionality. Currently redirects users to update costs in the Raw Material Master page rather than allowing direct edits.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component providing the app structure with a sticky header, navigation (desktop and mobile), connection status banner, main content area, and footer with caffeine.ai attribution. Includes the Jeevanam Kitchen branding and responsive design.",
  "frontend/src/components/Navigation.tsx": "Navigation component with links to Dashboard, Recipe Master, Raw Material Master, Calculator, and Cost Control pages, plus a logout button. Supports both desktop and mobile layouts with active route highlighting.",
  "frontend/src/components/ProductionCalculator.tsx": "Production calculator component that allows users to select a category and recipe, enter a quantity, and calculate required ingredient amounts with automatic unit conversion (g to Kg, ml to L). Displays results in a table and notifies parent component of calculations.",
  "frontend/src/components/ProductionHistory.tsx": "Displays today's production history in a table showing time, recipe name, quantity, and cost. Filters production records by today's date and shows a loading skeleton or empty state when appropriate.",
  "frontend/src/components/RawMaterialForm.tsx": "Form component for adding or editing raw materials with fields for name, unit type, and price per unit. Includes duplicate name validation, canister error handling with automatic retry logic, and exponential backoff for failed requests.",
  "frontend/src/components/RawMaterialTable.tsx": "Displays a table of all raw materials with edit and delete actions. Implements delete confirmation dialog with canister error handling and automatic retry mechanism with exponential backoff.",
  "frontend/src/components/RecipeList.tsx": "Lists all recipes in a table showing name, category, portion weight, and ingredient count. Provides edit and delete actions, maps raw material IDs to names, and shows empty state when no recipes exist.",
  "frontend/src/components/RecipeMasterForm.tsx": "Form for creating or editing recipes with fields for name, category, portion weight, and dynamic ingredient list. Allows adding/removing ingredients and maps raw material selections to ingredient data.",
  "frontend/src/components/StoreIssueSlip.tsx": "Generates and displays a store issue slip for recipe production, showing ingredients with quantities. Includes unit conversion (g to kg, ml to L), print functionality, and PDF download capability.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useBackendHealth.ts": "React hook that periodically monitors backend canister health with adaptive retry logic, invalidating all queries upon recovery from unhealthy state.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state and identity persistence with AuthClient.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend operations including recipes, raw materials, production records, and dashboard stats with error handling and localStorage-based production history.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom warm color palette (terracotta, sage green, cream) for light/dark themes and print styles for store issue slips.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers wrapping the main App component.",
  "frontend/src/pages/CostControl.tsx": "Page component for recipe cost analysis and profit margin calculation with an alert about raw material master requirements.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page displaying production summary statistics and production history with date header.",
  "frontend/src/pages/Login.tsx": "Login page that handles Internet Identity authentication and automatic admin setup after successful login with error handling.",
  "frontend/src/pages/ProductionCalculator.tsx": "Page component for production calculation that displays the calculator and conditionally renders a store issue slip based on calculation results.",
  "frontend/src/pages/RawMaterialMaster.tsx": "Main page component for managing raw materials with backend health monitoring, error recovery UI, and edit/save functionality for raw material entries.",
  "frontend/src/pages/RecipeMaster.tsx": "Recipe management page with toggle between list and form views, supporting recipe creation and editing with ingredient composition.",
  "frontend/src/utils/dashboardCalculations.ts": "Utility functions for calculating total ingredient consumption, finding top ingredients, and computing total production costs from production records.",
  "frontend/src/utils/errorHandling.ts": "Comprehensive error detection and classification utilities including canister stopped errors (IC0508/IC0503), network errors, auth errors, validation errors, with retry logic and user-friendly messaging.",
  "frontend/src/utils/pdfGenerator.ts": "Generates HTML-based store issue slip PDFs with production details, ingredient lists, and signature sections for download.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, typography, animations, and theme extensions for the application UI.",
  "project_state.json": "Project metadata tracking error handling features, known service unavailability issues, and pending backend health check endpoint implementation request."
}