{
  "kind": "build_request",
  "title": "Fix canister stopped error preventing raw material operations",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Investigate and resolve the 'Service temporarily unavailable. The canister is stopped.' error that occurs when attempting raw material operations after deployment",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Service temporarily unavailable. The canister is stopped. Please try again in a moment."
        ]
      },
      "acceptanceCriteria": [
        "Raw material operations complete successfully without canister stopped errors",
        "Backend canister remains running and responsive after deployment",
        "Error handling provides clear feedback if canister issues occur"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add backend initialization checks and error recovery mechanisms to prevent canister停止 state during admin setup and raw material operations",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-latest"
        ]
      },
      "acceptanceCriteria": [
        "Backend gracefully handles initialization state transitions",
        "Admin setup operations do not cause canister to stop",
        "Canister automatically recovers from transient stopped states if possible"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Improve frontend error handling to detect canister stopped errors and provide user-friendly guidance on next steps",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ]
      },
      "acceptanceCriteria": [
        "Frontend displays clear error message when canister is stopped",
        "User receives guidance on whether to retry or wait",
        "Error state does not leave UI in broken state"
      ]
    }
  ],
  "constraints": [
    "Must maintain existing admin authentication Principal-based access control",
    "Do not break existing recipe management, production calculator, or cost analysis features",
    "Preserve single-actor backend architecture"
  ],
  "nonGoals": [
    "Rewriting the entire backend architecture",
    "Changing the authentication system from Internet Identity",
    "Adding external monitoring or alerting systems"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}